clc;
clear;

% 测量数据处理理论与方法-协方差函数及其估计
% P45 例3.2

X =[16.4,15.9,16.3,15.8,15.4;
    16.3,16.1,16.2,15.9,15.5;
    16.8,16.4,15.9,16.3,16.3;
    16.6,16.2,16.3,16.2,16.3;
    16.8,16.7,16.1,16.2,16.3;
    16.6,16.6,16.4,16.2,16.3;
    16.7,16.6,17.0,16.3,16.2;
    16.8,16.5,16.9,16.5,15.9;
    16.9,16.4,16.1,16.6,16.2;
    16.1,16.6,16.2,17.1,17.0;
    16.5,16.7,16.7,16.8,16.5;
    17.1,16.9,16.6,16.8,16.7;
    16.8,16.9,16.8,17.1,17.0;
    17.0,16.9,16.7,16.9,17.0;
    17.1,16.9,16.7,16.9,17.0;
    16.2,16.0,16.3,16.5,16.4;
    16.1,15.9,16.2,16.4,16.4;
    16.1,15.9,16.0,16.1,16.5;];

% 求协方差，协方差阵为Dx
Dx=cov(X);

% 求协方差函数
% Saj=[0,4.511,10.747,16.753,22.22];
Saj=[0,0.4511,1.0747,1.6753,2.222];
Sij=zeros(5,5);
for i=1:5
    for j=1:5
        Sij(i,j)=Saj(1,j)-Saj(1,i);
    end
end
Sij;

% 将函数考虑为l=Ax+delta
% x为系数阵Coe，根据最小二乘法求得Coe
a=zeros(15,1);
l=zeros(15,1);
for i=1:5
    for j=1:5
        if i<=j
            index=(i-1)*(2*5-i+2)/2+j-i+1;
            a(index,1)=Sij(i,j);
            l(index,1)=Dx(i,j);
        end
    end
end
a;
l;

% 最小二乘法求得系数与结果
Coe=polyfit(a,l,4)
Dxx=polyval(Coe,a)

% 以下代码为不使用matlab内置求协方差和最小二乘法函数求得结果
% 求协方差，协方差阵为Dcov
average=zeros(5,1);
for i=1:5
    average(i,1)=sum(X(:,i)/18);
end

Dcov=zeros(5,5);
for i=1:5
    for j=1:5
        Dcov(i,j)=sum((X(:,i)-average(i,1)).*(X(:,j)-average(j,1)))/17;
    end
end

% 若采用自己拟合，才需要A
A=zeros(15,5);
for i=1:15
    A(i,:)=[a(i,1).^0,a(i,1).^1,a(i,1).^2,a(i,1).^3,a(i,1).^4];
end